// 16 завдання

// х----|-1-|-2-|-3-|-4-|-5-|
// ------|---|---|---|---|---|
// F(x)|-y-|-y-|-y-|-y-|-y-|

#include <stdio.h>
#include <math.h>

int main() {
    printf("x    | -1  | -2  | -3  | -4  | -5  |\n");
    printf("-----|-----|-----|-----|-----|-----|\n");

    // Виведення результатів для функції F(x) = e^(-x^2)
    printf("F(x) = e^(-x^2) |");
    for (int x = -1; x >= -5; x--) {
        // (постфіксний декремент): Спочатку повертає поточне значення змінної x.
        // Потім зменшує x на 1.
        double fx = exp(-pow(x, 2));
        // pow(x, 2) - це стандартна функція, яка підносить число х до степеня.
        // double fx = Результат цього обчислення записується у змінну типу double з ім'ям fx.
        printf(" %.2f |", fx);
    }
    printf("\n");

    // Виведення результатів для функції F(x) = sqrt(x)
    // Пам'ятаємо, що sqrt(x) не існує для від'ємних чисел, тому відображаємо NaN
    printf("F(x) = sqrt(x)  |");
    for (int x = -1; x >= -5; x--) {
        if (x < 0) {
            printf(" NaN |");
        } else {
            double fx = sqrt(x);
            printf(" %.2f |", fx);
        }
    }
    printf("\n");
}
